### Terraform Plan Results

#### Format Check: `success`
#### Init: `success`
#### Validate: `success`
#### Plan: `success`

<details><summary>Show Plan</summary>

```terraform
random_id.db_name_suffix: Refreshing state... [id=UjGNwA]
random_password.db_password: Refreshing state... [id=none]
google_service_account.external_secrets: Refreshing state... [id=projects/talana-sre-challenge-jesben/serviceAccounts/external-secrets-sa@talana-sre-challenge-jesben.iam.gserviceaccount.com]
data.google_client_config.default: Reading...
data.google_project.current: Reading...
google_compute_network.vpc: Refreshing state... [id=projects/talana-sre-challenge-jesben/global/networks/talana-vpc]
google_secret_manager_secret.db_connection: Refreshing state... [id=projects/talana-sre-challenge-jesben/secrets/talana-db-connection]
data.google_client_config.default: Read complete after 0s [id=projects/talana-sre-challenge-jesben/regions/us-east1/zones/]
google_secret_manager_secret_iam_member.db_connection_access: Refreshing state... [id=projects/talana-sre-challenge-jesben/secrets/talana-db-connection/roles/secretmanager.secretAccessor/serviceAccount:external-secrets-sa@talana-sre-challenge-jesben.iam.gserviceaccount.com]
google_service_account_iam_binding.workload_identity_binding: Refreshing state... [id=projects/talana-sre-challenge-jesben/serviceAccounts/external-secrets-sa@talana-sre-challenge-jesben.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
data.google_project.current: Read complete after 0s [id=projects/talana-sre-challenge-jesben]
google_compute_router.router: Refreshing state... [id=projects/talana-sre-challenge-jesben/regions/us-east1/routers/talana-router]
google_compute_global_address.private_ip_alloc: Refreshing state... [id=projects/talana-sre-challenge-jesben/global/addresses/private-ip-alloc]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/talana-sre-challenge-jesben/regions/us-east1/subnetworks/talana-subnet]
google_compute_router_nat.nat: Refreshing state... [id=talana-sre-challenge-jesben/us-east1/talana-router/talana-nat]
google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Ftalana-sre-challenge-jesben%2Fglobal%2Fnetworks%2Ftalana-vpc:servicenetworking.googleapis.com]
google_sql_database_instance.main: Refreshing state... [id=talana-db-52318dc0]
google_container_cluster.primary: Refreshing state... [id=projects/talana-sre-challenge-jesben/locations/us-east1-b/clusters/talana-gke-cluster]
google_sql_database.main: Refreshing state... [id=projects/talana-sre-challenge-jesben/instances/talana-db-52318dc0/databases/talana_db]
google_sql_user.app: Refreshing state... [id=app_user//talana-db-52318dc0]
data.google_container_cluster.my_cluster: Reading...
google_container_node_pool.primary_nodes: Refreshing state... [id=projects/talana-sre-challenge-jesben/locations/us-east1-b/clusters/talana-gke-cluster/nodePools/talana-node-pool]
google_secret_manager_secret_version.db_connection: Refreshing state... [id=projects/724665830062/secrets/talana-db-connection/versions/1]
data.google_container_cluster.my_cluster: Read complete after 0s [id=projects/talana-sre-challenge-jesben/locations/us-east1-b/clusters/talana-gke-cluster]
helm_release.argocd: Refreshing state... [id=argocd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.talana will be created
  + resource "google_artifact_registry_repository" "talana" {
      + create_time      = (known after apply)
      + description      = "Docker repository for Talana applications"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-east1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "talana-sre-challenge-jesben"
      + repository_id    = "talana-repo"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + cleanup_policies {
          + action = "KEEP"
          + id     = "keep-minimum-versions"

          + most_recent_versions {
              + keep_count            = 10
              + package_name_prefixes = []
            }
        }
    }

  # google_artifact_registry_repository_iam_member.github_actions_writer will be created
  + resource "google_artifact_registry_repository_iam_member" "github_actions_writer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-east1"
      + member     = "serviceAccount:github-actions-sa@talana-sre-challenge-jesben.iam.gserviceaccount.com"
      + project    = "talana-sre-challenge-jesben"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # google_artifact_registry_repository_iam_member.gke_reader will be created
  + resource "google_artifact_registry_repository_iam_member" "gke_reader" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-east1"
      + member     = "serviceAccount:default"
      + project    = "talana-sre-challenge-jesben"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + artifact_registry_image               = "us-east1-docker.pkg.dev/talana-sre-challenge-jesben/talana-repo/talana-backend"
  + artifact_registry_url                 = "us-east1-docker.pkg.dev/talana-sre-challenge-jesben/talana-repo"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @jesbensevi, Action: `pull_request`*